<?php

use yii\db\Migration;

/**
 * Class m181107_141805_add_avito_categories
 */
class m181107_141805_add_avito_categories extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {

        $this->batchInsert('sub_category', ['name', 'parent_id'], [
            ['Acer', 1],
            ['Alcatel', 1],
            ['ASUS', 1],
            ['BlackBerry', 1],
            ['BQ', 1],
            ['DEXP', 1],
            ['Explay', 1],
            ['Fly', 1],
            ['Highscreen', 1],
            ['HTC', 1],
            ['Huawei', 1],
            ['iPhone', 1],
            ['Lenovo', 1],
            ['LG', 1],
            ['Meizu', 1],
            ['Micromax', 1],
            ['Microsoft', 1],
            ['Motorola', 1],
            ['MTS', 1],
            ['Nokia', 1],
            ['Panasonic', 1],
            ['Philips', 1],
            ['Prestigio', 1],
            ['Samsung', 1],
            ['Siemens', 1],
            ['SkyLink', 1],
            ['Sony', 1],
            ['teXet', 1],
            ['Vertu', 1],
            ['Xiaomi', 1],
            ['ZTE', 1],
            ['Другие марки', 1],
            ['Рации', 1],
            ['Стационарные телефоны', 1],
            ['Аккумуляторы', 1],
            ['Гарнитуры и наушники', 1],
            ['Зарядные устройства', 1],
            ['Кабели и адаптеры', 1],
            ['Модемы и роутеры', 1],
            ['Запчасти', 1],
            ['Чехлы и плёнки', 1],

            ['Акустика', 3],
            ['Веб-камеры', 3],
            ['Джойстики и рули', 3],
            ['Клавиатуры и мыши', 3],
            ['CD, DVD и Blu-ray приводы', 3],
            ['Блоки питания', 3],
            ['Видеокарты', 3],
            ['Жёсткие диски', 3],
            ['Звуковые карты', 3],
            ['Контроллеры', 3],
            ['Корпусы', 3],
            ['Материнские платы', 3],
            ['Оперативная память', 3],
            ['Процессоры', 3],
            ['Системы охлаждения', 3],
            ['Мониторы', 3],
            ['Переносные жёсткие диски', 3],
            ['Сетевое оборудование', 3],
            ['ТВ-тюнеры', 3],
            ['Флэшки и карты памяти', 3],
            ['Аксессуары', 3],

            ['Компактные фотоаппараты', 4],
            ['Зеркальные фотоаппараты', 4],
            ['Плёночные фотоаппараты', 4],
            ['Бинокли и телескопы', 4],
            ['Объективы', 4],
            ['Оборудование и аксессуары', 4],

            ['Игровые приставки', 5],
            ['Игры для приставок', 5],
            ['Программы', 5],
            ['Компьютерные игры', 5],

            ['МФУ, копиры и сканеры', 6],
            ['Принтеры', 6],
            ['Телефония', 6],
            ['ИБП, сетевые фильтры', 6],
            ['Уничтожители бумаг', 6],
            ['Блоки питания и батареи', 6],
            ['Болванки', 6],
            ['Бумага', 6],
            ['Кабели и адаптеры', 6],
            ['Картриджи', 6],
            ['Канцелярия', 6],

            ['Планшеты', 7],
            ['Электронные книги', 7],
            ['Аккумуляторы', 7],
            ['Гарнитуры и наушники', 7],
            ['Док-станции', 7],
            ['Зарядные устройства', 7],
            ['Кабели и адаптеры', 7],
            ['Модемы и роутеры', 7],
            ['Стилусы', 7],
            ['Чехлы и плёнки', 7],
            ['Другое', 7],

            ['Acer', 8],
            ['Apple', 8],
            ['ASUS', 8],
            ['Compaq', 8],
            ['Dell', 8],
            ['Fujitsu', 8],
            ['HP', 8],
            ['Lenovo', 8],
            ['MSI', 8],
            ['Microsoft', 8],
            ['Samsung', 8],
            ['Sony', 8],
            ['Toshiba', 8],
            ['Packard Bell', 8],
            ['Другой', 8],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m181107_141805_add_avito_categories cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m181107_141805_add_avito_categories cannot be reverted.\n";

        return false;
    }
    */
}
